Repository: sonnyp/Workbench
Catalog: po/*.po
Languages: de, nb_no

source: Learn and prototype with GNOME technologies
de: Lerne und baue Prototypen mit GNOME-Technologien
nb_no: Lær deg og lag prototyper med GNOME-teknologi

source: CSS;JavaScript;GJS;Blueprint;builder;Vala;
nb_no: CSS;JavaS

source: Workbench goal is to let you experiment with GNOME technologies, no matter if tinkering for the first time or building and testing a GTK user interface.
nb_no: Målet med Workbench er å la deg eksperimentere med GNOME-teknologi, om så det er første gang du bygger noe eller tester et GTK-brukergrensesnitt.

source: Among other things, Workbench comes with
de: Unter anderem kommt Workbench mit
nb_no: Blandt annet kommer Workbench med

source: realtime GTK/CSS preview
de: GTK/CSS Vorschau in Echtzeit
nb_no: GTK/CSS-forhåndsvisning i sanntid

source: library of examples
de: Bibliothek an Beispielen
nb_no: et eksempelbibliotek

source: JavaScript and Vala runs without any setup
nb_no: JavaScript og Vala kjører uten oppsett

source: XML and Blueprint for describing user interface
nb_no: CML og Blueprint for beskrivelse av brukergrensesnitt

source: syntax highlighting, undo/redo, autosave, session restore
nb_no: syntaksframheving, angre/gjenta, automatisk lagring, øktgjenopprettelse

source: code formatter
de: Code Formattierer
nb_no: kode-formaterer

source: console logs
de: Konsolenprotokolle
nb_no: konsoll-logger

source: Side by side editors with live preview on the right and console in the bottom
de: Nebeneinander liegende Editor-Panele mit Echtzeitvorschau auf der rechten Seite und einer Konsole unten
nb_no: Redigering side-ved-side, med sanntidsforhåndsvising på høyresiden og konsoll på bunnen

source: Highlights
nb_no: Framheving

source: Add Blueprint markup syntax for UI
nb_no: Blueprint-oppmerkningssyntaks lagt til for grensesnittet

source: Add Vala programming language for Code
nb_no: Vala-protrammeringsspråk lagt til for Kode

source: Add support for previewing templates
nb_no: Støtte for forhåndsvisning av maler

source: Add support for previewing signal handlers
nb_no: Tillagt støtte for forhåndsvisning av signalhåndterere

source: Include all icons from icon-development-kit
nb_no: Alle ikoner fra icon-development-kit inkludert

source: Improve application design
nb_no: Forbedret programdesign

source: Distribute Library examples under CC0-1.0
nb_no: Bibliotekseksempler distribuert som CC0-1.0

source: Respect system preference for color scheme
nb_no: Systeminnstilling for fargedrakt respektert

source: Fix error when opening file
nb_no: Fikset feil ved åpning av fil

source: Other changes
nb_no: Andre endringer

source: Silence platform tools
nb_no: Forstumming av plattformsverktøy

source: Make Library examples only open relevant panels
nb_no: Bibliotekseksmpler åpner nå kun relevante paneler

source: Prevent running Code if the panel is not visible
nb_no: Kode forhindres fra å kjøre hvis panelet ikke er synlig

source: Move Bookmarks to the main menu
nb_no: Bokmerker flyttet til hovedmenyen

source: Improve Library examples
nb_no: Bibliotekseksempeler forbedret

source: Performance optimizations
nb_no: Ytelsesoptimaliseringer

source: Show a placeholder when all panels are invisible
nb_no: Plassholder vist når alle panelene er synlige

source: Crash fixes
nb_no: Krasjfikser

source: Use org.gnome.Sdk runtime
nb_no: Bruk av org.gnome.Sdk-kjøretidsrutine

source: Add a Library of examples
de: Eine Beispiel-Bibliothek hinzufügen
nb_no: Eksempelbibliotek tillagt

source: Add an example of WebSocket client
de: Ein Beispiel eines WebSocket Clients hinzufügen
nb_no: Eksempel på WebSocket-klient lagt til

source: Add an example of toasts
de: Ein Beispiel für eine Benachrichtigung hinzufügen
nb_no: Eksempel på oppsprettsmerknad lagt til

source: Add an example of application window
de: Ein Beispiel für ein Anwendungsfenster hinzufügen
nb_no: Eksempel på programvindu lagt til

source: Add an example of desktop notification
de: Ein Beispiel für eine Desktop-Benachrichtigung hinzufügen
nb_no: Eksempel på skrivebordsmerknad lagt til

source: Add Adwaita Demo, GTK Demo, GTK Widget Factory and GTK Icon Browser
de: Eine Adwaita Demo, GTK Demo, GTK Widget Factory und einen GTK Icon Browser hinzufügen
nb_no: Adwaita-demo, GTK-demo, GTK-miniprogramsfabrikk, og GTK-ikonutforsker lagt til

source: The Console can be collapsed by resizing it
de: Die Konsole kann durch Ändern ihrer Größe eingeklappt werden
nb_no: Konsollen kan nå sammenfoldes ved å endre dens størrelse

source: Prevent system.exit from quitting Workbench
de: Verhindern, dass system.exit Workbench beendet
nb_no: Forhindring av at system.exit avslutter Workbench

source: Allow calling GObject.registerClass multiple times
de: Mehrfachen Aufruf von GObject.registerClass zulassen
nb_no: Påkalling av GObject.registerClass flere ganger tillatt

source: Prevent crash caused by using non GtkBuildable objects
de: Verhindern eines Absturzes, der durch die Verwendung von nicht GtkBuildable-Objekten verursacht wird
nb_no: Forhindring av krasj forårsaket av objekter som ikke er «GtkBuildable»

source: Allow using DBus and Gio.Application
de: Erlaubt die Verwendung von DBus und Gio.Application
nb_no: Bruk av DBus og Gio.Application tillatt

source: Allow using network
de: Nutzung des Netzwerks zulassen
nb_no: Bruk av nettverk tillatt

source: Enable GtkWindow objects preview
de: Vorschau für GtkWindow-Objekte aktivieren
nb_no: Forhåndsvising av GtkWindow-objekter

source: The console is now resizable
de: Die Größe der Konsole kann jetzt geändert werden
nb_no: Det er nå mulig å endre størrelsen på konsollen

source: Redesign the dark/light mode switcher
de: Überarbeitung des Dunkel-/Hell-Modus Schalters
nb_no: Bytting til lys/mørk drakt redesignet

source: Show platform and dependencies in about dialog
de: Plattform und Abhängigkeiten im Info-Dialog anzeigen
nb_no: Plattform og avhengigheter vis i «Om»

source: Update to GNOME platform 42
de: Aktualisierung auf GNOME-Plattform 42
nb_no: Oppgradering til GNOME-plattform 42

source: Various fixes
de: Verschiedene Korrekturen
nb_no: Forskjellige feilfikser

source: This is the first release of Workbench. We hope you like it.
de: Dies ist die erste Version von Workbench. Wir hoffen, es gefällt euch.
nb_no: Første utgave av Workbench. Håper du liker det.

source: Library
de: Bibliothek
nb_no: Bibliotek

source: Keyboard Shortcuts
de: Tastenkombinationen
nb_no: Tastatursnarveier

source: About My App
nb_no: Om programmet

source: Learn and prototype with GNOME technologies
de: Lernen und Prototyping mit GNOME-Technologien
nb_no: Lær om og lag prototyper av GNOME-teknologi

source: translator-credits
de: Übersetzer-Credits
nb_no: Allan Nordhøy <epost@anotheragency.no>

source: Import File
nb_no: Importer fil

source: Clear Console
de: Konsole leeren
nb_no: Tøm konsoll

source: Inspector
de: Inspektor
nb_no: Inspektør

source: Undo
nb_no: Angre

source: Redo
nb_no: Gjenta

source: Quit
de: Beenden
nb_no: Avslutt

source: Use Light mode
de: Hellen Modus nutzen
nb_no: Ifør lys drakt

source: Use Dark mode
de: Dunklen Modus nutzen
nb_no: Ifør mørk drakt

source: <b>Code</b>
nb_no: <b>Kode</b>

source: Switch document
nb_no: Bytt dokument

source: _Run
nb_no: _Kjør

source: Run (Ctrl+⏎)
de: Ausführen (Strg+⏎)
nb_no: Kjør (Ctrl+⏎)

source: <b>Style CSS</b>
nb_no: <b>CSS-stil</b>

source: <b>UI</b>
nb_no: <b>Grensesnitt</b>

source: Convert to XML
nb_no: Konverter til XML

source: Convert to Blueprint
nb_no: Konverter til Blueprint

source: <b>Preview</b>
nb_no: <b>Forhåndsvis</b>

source: Take Screenshot of Preview
de: Screenshot der Vorschau machen
nb_no: Utfør skjermavbildning av forhåndsvisning

source: Windowed Preview
de: Vorschau in separatem Fenster
nb_no: Vindusbasert forhåndsvisning

source: Show Preview Window
nb_no: Vis forhåndsvisningsvindu

source: Close Preview Window
nb_no: Lukk forhåndsvisningsvindu

source: Show logs (Ctrl+Shift+K)
de: Protokolle anzeigen (Strg+Umschalt+K)
nb_no: Vis loggføring (Ctrl+Shift+K)

source: _Inspector
nb_no: _Inspektør

source: Open GTK Inspector (Ctrl+Shift+I)
de: GTK-Inspektor öffnen (Strg+Umschalt+I)
nb_no: Åpne GTK-inspektør (Ctrl+Shift+I)

source: Cl_ear
nb_no: T_øm

source: Clear console (Ctrl+K)
de: Konsole leeren (Strg+K)
nb_no: Tøm konsoll (Ctrl+K)

source: Import File…
nb_no: Importer fil …

source: Bookmarks
de: Lesezeichen
nb_no: Bokmerker

source: Learn
de: Lernen
nb_no: Lær mer

source: Developer Documentation
nb_no: Utviklerdokumentasjon

source: Human Interface Guidelines
nb_no: Retningslinjer for menneskelige grensesnitt

source: Get help
de: Hilfe erhalten
nb_no: Få hjelp

source: Platform Tools
de: Plattform Tools
nb_no: Plattformsverktøy

source: GTK Widget Factory
nb_no: GTK-miniprogramsfabrikk

source: About Workbench
de: Über Workbench
nb_no: Om Workbench

source: Workbench goal is to let you experiment with GNOME technologies, no matter if tinkering for the first time or building and testing a custom GTK widget.
de: Workbenchs Ziel ist es dir das Experimentieren mit GNOME Technologien zu ermöglichen, egal ob du damit das erste mal herumbastelst oder dein eigenes GTK-Widget erstellst und testest.

source: JavaScript for quick and easy scripting
de: JavaScript für schnelles und einfaches Skripten

source: Syntax highlighting, undo/redo, autosave
de: Syntaxhervorhebung, Rückgängig machen / Wiederherstellen, automatischem Speichern

source: Take a png screenshot of the preview
de: Einen png Screenshot der Vorschau machen

source: Run
de: Ausführen

source: Open Console
de: Konsole öffnen

source: Are you sure you want to discard your changes?
de: Bist du sicher, dass du deine Änderungen verwerfen willst?

source: Open Library of Demos and Examples (Ctrl+Shift+O)
de: Bibliothek mit Demos und Beispielen öffnen (Strg+Umschalt+O)

source: Style
de: Stil

source: Preview
de: Vorschau

source: Style - CSS
de: Stil - CSS

source: Console
de: Konsole

source: Clear
de: Leeren

source: Examples to start from or get inspired by
de: Beispiele, von denen du starten oder dich inspirieren lassen kannst

source: This interface can only be previewed as a separate window. We recommend using "Always on Top"
de: Diese Vorschau der Oberfläche kann nur als separates Fenster angezeigt werden. Wir empfehlen die Verwendung von „Always on Top“

source: Open File…
de: Datei öffnen…

source: UI components
de: UI Komponenten

source: Platform components
de: Plattformkomponenten

source: Reference
de: Referenz
